Product/Production/Common/DocumentTransformEJB/src/conf/xml-resources/web-services/DocumentTransform/wsdl/NhincComponentDocumentTransform.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="NhincComponentDocumentTransform" targetNamespace="urn:gov:hhs:fha:nhinc:nhinccomponentdocumenttransform"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:tns="urn:gov:hhs:fha:nhinc:nhinccomponentdocumenttransform" 
    xmlns:doctrans="urn:gov:hhs:fha:nhinc:common:nhinccommondocumenttransform" 
    xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" 
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="urn:gov:hhs:fha:nhinc:nhinccomponentdocumenttransform">
            <xsd:import namespace="urn:gov:hhs:fha:nhinc:common:nhinccommondocumenttransform" schemaLocation="../schemas/nhinc/common/NhincCommonDocumentTransform.xsd"/>
        </xsd:schema>
    </types>
    <message name="ReplaceAdhocQueryPatientIdRequest">
        <part name="ReplaceAdhocQueryPatientIdRequest" element="doctrans:ReplaceAdhocQueryPatientIdRequest"/>
    </message>
    <message name="ReplaceAdhocQueryPatientIdResponse">
        <part name="ReplaceAdhocQueryPatientIdResponse" element="doctrans:ReplaceAdhocQueryPatientIdResponse"/>
    </message>
    <portType name="NhincComponentDocumentTransformPortType">
        <operation name="ReplaceAdhocQueryPatientId">
            <input name="input1" message="tns:ReplaceAdhocQueryPatientIdRequest"/>
            <output name="output1" message="tns:ReplaceAdhocQueryPatientIdResponse"/>
        </operation>
    </portType>
    <binding name="NhincComponentDocumentTransformPortTypeBinding" type="tns:NhincComponentDocumentTransformPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ReplaceAdhocQueryPatientId">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="NhincComponentDocumentTransformService">
        <port name="NhincComponentDocumentTransformPortTypeBindingPort" binding="tns:NhincComponentDocumentTransformPortTypeBinding">
            <soap:address location="http://localhost:${NhincHttpPort}/NhinConnect/NhincComponentDocumentTransform"/>
        </port>
    </service>
    <plnk:partnerLinkType name="NhincComponentDocumentTransform">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="NhincComponentDocumentTransformPortTypeRole" portType="tns:NhincComponentDocumentTransformPortType"/>
    </plnk:partnerLinkType>
</definitions>
