Product/Production/Common/DocumentTransformCA/test/ReplaceAdhocQueryPatientIdTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:gov:hhs:fha:nhinc:common:nhinccommondocumenttransform" xmlns:urn1="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:urn2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:urn3="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:urn4="urn:gov:hhs:fha:nhinc:common:nhinccommon">
  <soapenv:Body>
    <urn:ReplaceAdhocQueryPatientIdRequest>
      <urn1:AdhocQueryRequest id="" comment="" federated="false" federation="" startIndex="0" maxResults="-1">
        <urn1:ResponseOption returnType="LeafClass" returnComposedObjects="true"/>
        <urn3:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d" home="urn:oid:1.1">
          <!--Zero or more repetitions:-->
          <urn3:Slot name="$XDSDocumentEntryPatientId">
            <urn3:ValueList>
              <urn3:Value>1234^^^&amp;1.1&amp;ISO</urn3:Value>
            </urn3:ValueList>
          </urn3:Slot>
        </urn3:AdhocQuery>
      </urn1:AdhocQueryRequest>
      <urn:QualifiedSubjectIdentifier>
        <urn4:SubjectIdentifier>4567</urn4:SubjectIdentifier>
        <urn4:AssiginingAuthorityIdentifier>2.2</urn4:AssiginingAuthorityIdentifier>
      </urn:QualifiedSubjectIdentifier>
      <urn:HomeCommunityId>urn:oid:7.7</urn:HomeCommunityId>
    </urn:ReplaceAdhocQueryPatientIdRequest>
  </soapenv:Body>
</soapenv:Envelope>